# 다음 문제를 풀이하시오.

### Q1. pandas 모듈을 pd로, numpy 모듈을 np로 불러오시오.

In [1]:
import pandas as pd
import numpy as np

### Q2. "class_scores.csv"를 pandas 모듈을 활용하여 불러오고 객체 종류를 확인하시오
(단, df 객체에 저장하시오)

In [4]:
df = pd.read_csv("../dataset/class_scores.csv")
type(df)

pandas.core.frame.DataFrame

### Q3. df의 첫 3개 row를 출력하시오

In [5]:
df.head(3)

   Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
0   10101      1     A      M    55       84       50         40       59
1   10102      1     A      M    29       94       41         87       57
2   10103      1     A      F    28       80       68         41      100

### Q4. df의 마지막 2개 row를 출력하시오

In [6]:
df.tail(2)

     Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
598   30539      3     E      M    51       67       39         91       55
599   30540      3     E      M    76       29       80         91       66

### Q5. df의 차원을 확인하시오

In [7]:
df.ndim

2

### Q6. df의 row 개수를 확인하시오

In [8]:
df.shape[0]

600

### Q7. df의 column 개수를 확인하시오

In [9]:
df.shape[1]

9

### Q8. df의 column 이름을 확인하시오

In [11]:
df.columns.values

array(['Stu_ID', 'grade', 'class', 'gender', 'Math', 'English', 'Science',
       'Marketing', 'Writing'], dtype=object)

### Q9. 2학년의 학번, 학년, 성적 전체를 추출하여 df_sub 객체에 저장하시오.

In [102]:
df_sub = df.loc[df.grade == 2, ["Stu_ID", "grade", *df.columns[-5:]]]
df_sub

     Stu_ID  grade  Math  English  Science  Marketing  Writing
200   20101      2    57       68       98         88       40
201   20102      2    94       33       32         44       90
202   20103      2    75       73       34         37       85
203   20104      2    73       85       35         39       65
204   20105      2    64       26       86         64       72
..      ...    ...   ...      ...      ...        ...      ...
395   20536      2    29       33       95         40       51
396   20537      2    95      100       96         95       60
397   20538      2    79       55       32         78       31
398   20539      2    74       60       99         68       80
399   20540      2    58       88       35         92       41

[200 rows x 7 columns]

### Q10. df_sub를 기준으로 학생 개개인의 성적 평균을 계산하고 학번과 같이 "score_avg.csv"로 저장하시오.

In [115]:
mean_ = df_sub.iloc[:, 2:].mean(axis=1)
score_avg = pd.DataFrame({"Stu_ID": df_sub.Stu_ID, "mean": mean_})
score_avg.to_csv("score_avg.csv", index=False)
score_avg

     Stu_ID  mean
200   20101  70.2
201   20102  58.6
202   20103  60.8
203   20104  59.4
204   20105  62.4
..      ...   ...
395   20536  49.6
396   20537  89.2
397   20538  55.0
398   20539  76.2
399   20540  62.8

[200 rows x 2 columns]

### Q11. df_sub를 기준으로 과목별 성적 최고점, 최저점, 표준편차를 계산하고 과목명과 함께 score_stat에 저장하시오.

In [145]:
grade = df_sub.iloc[:, 2:]
max_, min_, std_ = grade.max(), grade.min(), grade.std()
score_stat = pd.DataFrame({"max": max_, "min": min_, "std": std_})
# score_stat = df_sub.iloc[:, 2:].agg(["max", "min", "std"]).transpose()
# score_stat = df_sub.describe().drop(["Stu_ID", "grade"], 1).transpose()
score_stat

           max  min        std
Math       100   25  21.966154
English    100   25  20.638307
Science    100   25  23.344244
Marketing  100   25  22.021939
Writing    100   25  21.772637

### Q12. score_stat의 index를 0 ~ 4로 만드시오.

In [148]:
# score_stat.insert(0, "subject", score_stat.index)
# score_stat.set_index(pd.Index(range(5)))

# score_stat = score_stat.reset_index()
# score_stat.rename(columns={score_stat.columns[0]: "subject"})
score_stat

           max  min        std
Math       100   25  21.966154
English    100   25  20.638307
Science    100   25  23.344244
Marketing  100   25  22.021939
Writing    100   25  21.772637

### Q13. score_stat 객체를 "score_stat.csv"로 저장하시오.

In [149]:
score_stat.to_csv("score_stat.csv")